{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hello",
                "Hi",
                "How is your day",
                "How's life going?",
                "Hey",
                "Is anyone there?"
            ],
            "responses": [
                "Heyy :-)",
                "Hello, thanks for the visit. What can I do for you?",
                "Hey there, what can I do for you?",
                "Hello, what are you looking for?",
                "Hi, Can you tell me what you're looking for?"
            ]
        },
        { 
            "tag": "goodbye",
            "patterns": ["Bye", "Have a nice day", "Goodbye", "See you later", "Thanks for the help"],
            "responses": [
                "See you later, thanks for visiting",
                "Have a nice day",
                "Can I help you with something else?",
                "Thank you and goodbye"
            ]
        },
        {
            "tag": "university_services",
            "patterns": [
                "What services does the university website offer?",
                "Tell me about the university website services",
                "What can I do on the university website?",
                "Services on the university site",
                "How can the university website assist me?"
            ],
            "responses": [
                "The university website provides a comprehensive range of services, covering different sectors like the Department, Education, Quality, Research, Staff, Announcements, and Computer Labs.",
                "You can explore various services on the university website, such as information about the Department, Education, Quality, Research, Staff, Announcements, and Computer Labs.",
                "Navigate through the university website to access specific services related to the Department, Education, Quality, Research, Staff, Announcements, and Computer Labs.",
                "Discover a wealth of information on the university website, including details about the Department, Education, Quality, Research, Staff, Announcements, and Computer Labs."
            ]
        },
        {
            "tag": "department_info",
            "patterns": [
                "Tell me about the Department",
                "Departmental information",
                "What does the Department offer?",
                "Details about the Department",
                "Department structure"
            ],
            "responses": [
                "The Department segment covers information about greetings, history, structure and organs, secretariat, internal regulations, departmental committees, health and safety, departmental events, AI Hub, alumni, international advisory committee, and daily arrangements.",
                "Explore the Department section for details on greetings, history, structure and organs, secretariat, internal regulations, departmental committees, health and safety, departmental events, AI Hub, alumni, international advisory committee, and daily arrangements.",
                "Discover insights into the Department, including greetings, history, structure and organs, secretariat, internal regulations, departmental committees, health and safety, departmental events, AI Hub, alumni, international advisory committee, and daily arrangements."
            ]
        },
        {
            "tag": "education_info",
            "patterns": [
                "Tell me about education",
                "Education at the university",
                "What does the university offer for education?",
                "Details about academic programs",
                "Undergraduate and postgraduate education"
            ],
            "responses": [
                "The Education segment provides information on the study guide, undergraduate education, postgraduate education, doctoral studies program, academic calendar, timetable of courses-examinations, advisor professor, and ERASMUS+.",
                "Explore the Education section for details on the study guide, undergraduate education, postgraduate education, doctoral studies program, academic calendar, timetable of courses-examinations, advisor professor, and ERASMUS+.",
                "Discover insights into Education, including the study guide, undergraduate education, postgraduate education, doctoral studies program, academic calendar, timetable of courses-examinations, advisor professor, and ERASMUS+."
            ]
        },
        {
            "tag": "quality_info",
            "patterns": [
                "Tell me about quality",
                "Quality policies at the university",
                "What does the university offer for quality assurance?",
                "Details about quality policies",
                "Accreditation of programs"
            ],
            "responses": [
                "The Quality segment covers information on quality policy, targeting, internal departmental evaluations, external departmental evaluations, and accreditation of the undergraduate program of studies.",
                "Explore the Quality section for details on quality policy, targeting, internal departmental evaluations, external departmental evaluations, and accreditation of the undergraduate program of studies.",
                "Discover insights into Quality, including quality policy, targeting, internal departmental evaluations, external departmental evaluations, and accreditation of the undergraduate program of studies."
            ]
        },
        {
            "tag": "research_info",
            "patterns": [
                "Tell me about research",
                "Research activities at the university",
                "What does the university offer for research?",
                "Details about research departments",
                "Publications and workshops"
            ],
            "responses": [
                "The Research segment provides information on research sectors, workshops, distinctions, doctorates, publications, and various staff categories involved in research activities.",
                "Explore the Research section for details on research sectors, workshops, distinctions, doctorates, publications, and various staff categories involved in research activities.",
                "Discover insights into Research, including research sectors, workshops, distinctions, doctorates, publications, and various staff categories involved in research activities."
            ]
        },
        {
            "tag": "announcements_info",
            "patterns": [
                "Tell me about announcements",
                "University announcements",
                "What announcements are available?",
                "Details about urgent announcements",
                "General announcements at the university"
            ],
            "responses": [
                "The Announcements segment covers information on urgent announcements, general announcements, registrations, course declarations, textbooks, announcements for first-year students, undergraduate studies, postgraduate studies, doctoral studies, doctoral dissertation presentations, seminars, conferences, postgraduate scholarships, news, events, and job opportunities for graduates.",
                "Explore the Announcements section for details on urgent announcements, general announcements, registrations, course declarations, textbooks, announcements for first-year students, undergraduate studies, postgraduate studies, doctoral studies, doctoral dissertation presentations, seminars, conferences, postgraduate scholarships, news, events, and job opportunities for graduates.",
                "Discover insights into Announcements, including urgent announcements, general announcements, registrations, course declarations, textbooks, announcements for first-year students, undergraduate studies, postgraduate studies, doctoral studies, doctoral dissertation presentations, seminars, conferences, postgraduate scholarships, news, events, and job opportunities for graduates."
            ]
        },
        {
            "tag": "computer_labs_info",
            "patterns": [
                "Tell me about computer labs",
                "Computer labs at the university",
                "What does the university offer for computer labs?",
                "Details about computing resources",
                "Computer lab services"
            ],
            "responses": [
                "The Computer Labs segment provides information on space, personnel, computing resources, services, directions, room schedule, operating regulations, and how to send requests related to computer labs.",
                "Explore the Computer Labs section for details on space, personnel, computing resources, services, directions, room schedule, operating regulations, and how to send requests related to computer labs.",
                "Discover insights into Computer Labs, including space, personnel, computing resources, services, directions, room schedule, operating regulations, and how to send requests related to computer labs."
            ]
        }
    ]
}
