{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Γεια σου",
                "Γεια",
                "Πώς είναι η μέρα σου",
                "Πώς πάει η ζωή;",
                "Χαίρετε",
                "Είναι κανείς εκεί;"
            ],
            "responses": [
                "Γειαα :-)",
                "Γεια σας, ευχαριστώ για την επίσκεψη. Σε τι μπορώ να βοηθήσω;",
                "Γεια σας, τι μπορώ να κάνω για εσάς;",
                "Γεια σας, τι ψάχνετε;",
                "Γεια, μπορείτε να μου πείτε τι ψάχνετε;"
            ]
        },
        { 
            "tag": "goodbye",
            "patterns": ["Αντίο", "Καλή σας μέρα", "Αντίο", "Θα τα πούμε αργότερα", "Ευχαριστώ για τη βοήθεια"],
            "responses": [
                "Τα λέμε αργότερα, ευχαριστούμε που μας επισκεφθήκατε",
                "Καλή σας μέρα",
                "Μπορώ να σας βοηθήσω και με κάτι άλλο;",
                "Σας ευχαριστώ και αντίο"
            ]
        },
        {
            "tag": "university_services",
            "patterns": [
                "Ποιες υπηρεσίες προσφέρει ο ιστότοπος του πανεπιστημίου;",
                "Πείτε μου για τις υπηρεσίες του ιστότοπου του πανεπιστημίου",
                "Τι μπορώ να κάνω στον ιστότοπο του πανεπιστημίου;",
                "Υπηρεσίες στον ιστότοπο του πανεπιστημίου",
                "Πώς μπορεί ο ιστότοπος του πανεπιστημίου να με βοηθήσει;"
            ],
            "responses": [
                "Ο ιστότοπος του πανεπιστημίου παρέχει μια ολοκληρωμένη γκάμα υπηρεσιών, καλύπτοντας διάφορους τομείς όπως το Τμήμα, Εκπαίδευση, Ποιότητα, Έρευνα, Προσωπικό, Ανακοινώσεις και Εργαστήρια Η/Υ.",
                "Μπορείτε να εξερευνήσετε διάφορες υπηρεσίες στον ιστότοπο του πανεπιστημίου, όπως πληροφορίες σχετικά με το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Η/Υ.",
                "Περιηγηθείτε στον ιστότοπο του πανεπιστημίου για να έχετε πρόσβαση σε συγκεκριμένες υπηρεσίες που αφορούν το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Η/Υ.",
                "Ανακαλύψτε μια πληθώρα πληροφοριών στον ιστότοπο του πανεπιστημίου, συμπεριλαμβανομένων λεπτομερειών για το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Η/Υ."
            ]
        },
        {
            "tag": "department_info",
            "patterns": [
                "Πείτε μου για το Τμήμα",
                "Πληροφορίες τμηματικού χαρακτήρα",
                "Τι προσφέρει το Τμήμα;",
                "Λεπτομέρειες για το Τμήμα",
                "Δομή τμήματος"
            ],
            "responses": [
                "Το τμήμα καλύπτει πληροφορίες για χαιρετισμούς, ιστορία, δομή και όργανα, γραφείο, εσωτερικούς κανονισμούς, τμηματικές επιτροπές, υγεία και ασφάλεια, τμηματικές εκδηλώσεις, AI Hub, απόφοιτοι, διεθνή επιτροπή συμβούλων και καθημερινές διατάξεις.",
                "Εξερευνήστε την ενότητα του Τμήματος για λεπτομέρειες σχετικά με χαιρετισμούς, ιστορία, δομή και όργανα, γραφείο, εσωτερικούς κανονισμούς, τμηματικές επιτροπές, υγεία και ασφάλεια, τμηματικές εκδηλώσεις, AI Hub, απόφοιτοι, διεθνή επιτροπή συμβούλων και καθημερινές διατάξεις.",
                "Ανακαλύψτε πληροφορίες σχετικά με το Τμήμα, συμπεριλαμβανομένων χαιρετισμών, ιστορίας, δομής και οργάνων, γραφείου, εσωτερικών κανονισμών, τμηματικών επιτροπών, υγείας και ασφάλειας, τμηματικών εκδηλώσεων, AI Hub, αποφοίτων, διεθνούς επιτροπής συμβούλων και καθημερινών διατάξεων.",
                "Ανακαλύψτε εισαγωγές στο Τμήμα, συμπεριλαμβανομένων χαιρετισμών, ιστορίας, δομής και οργάνων, γραφείου, εσωτερικών κανονισμών, τμηματικών επιτροπών, υγείας και ασφάλειας, τμηματικών εκδηλώσεων, AI Hub, αποφοίτων, διεθνούς επιτροπής συμβούλων και καθημερινών διατάξεων."
            ]
        },
        {
            "tag": "education_info",
            "patterns": [
                "Πείτε μου για την εκπαίδευση",
                "Εκπαίδευση στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για την εκπαίδευση;",
                "Λεπτομέρειες για ακαδημαϊκά προγράμματα",
                "Προπτυχιακή και μεταπτυχιακή εκπαίδευση"
            ],
            "responses": [
                "Η ενότητα Εκπαίδευσης παρέχει πληροφορίες για τον οδηγό σπουδών, την προπτυχιακή εκπαίδευση, τη μεταπτυχιακή εκπαίδευση, το πρόγραμμα διδακτορικών σπουδών, το ακαδημαϊκό ημερολόγιο, το χρονοδιάγραμμα μαθημάτων-εξετάσεων, τον καθηγητή-σύμβουλο και το ERASMUS+.",
                "Εξερευνήστε την ενότητα Εκπαίδευσης για λεπτομέρειες σχετικά με τον οδηγό σπουδών, την προπτυχιακή εκπαίδευση, τη μεταπτυχιακή εκπαίδευση, το πρόγραμμα διδακτορικών σπουδών, το ακαδημαϊκό ημερολόγιο, το χρονοδιάγραμμα μαθημάτων-εξετάσεων, τον καθηγητή-σύμβουλο και το ERASMUS+.",
                "Ανακαλύψτε εισαγωγές στην Εκπαίδευση, συμπεριλαμβανομένων του οδηγού σπουδών, της προπτυχιακής εκπαίδευσης, της μεταπτυχιακής εκπαίδευσης, του προγράμματος διδακτορικών σπουδών, του ακαδημαϊκού ημερολογίου, του χρονοδιαγράμματος μαθημάτων-εξετάσεων, του καθηγητή-σύμβουλου και του ERASMUS+."
            ]
        },
        {
            "tag": "quality_info",
            "patterns": [
                "Πείτε μου για την ποιότητα",
                "Πολιτικές ποιότητας στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για την διασφάλιση της ποιότητας;",
                "Λεπτομέρειες για πολιτικές ποιότητας",
                "Πιστοποίηση προγραμμάτων"
            ],
            "responses": [
                "Η ενότητα Ποιότητας καλύπτει πληροφορίες για πολιτική ποιότητας, στόχευση, εσωτερικές τμηματικές αξιολογήσεις, εξωτερικές τμηματικές αξιολογήσεις και πιστοποίηση του προγράμματος σπουδών της προπτυχιακής εκπαίδευσης.",
                "Εξερευνήστε την ενότητα Ποιότητας για λεπτομέρειες σχετικά με πολιτική ποιότητας, στόχευση, εσωτερικές τμηματικές αξιολογήσεις, εξωτερικές τμηματικές αξιολογήσεις και πιστοποίηση του προγράμματος σπουδών της προπτυχιακής εκπαίδευσης.",
                "Ανακαλύψτε εισαγωγές στην Ποιότητα, συμπεριλαμβανομένων πολιτικής ποιότητας, στόχευσης, εσωτερικών τμηματικών αξιολογήσεων, εξωτερικών τμηματικών αξιολογήσεων και πιστοποίησης του προγράμματος σπουδών της προπτυχιακής εκπαίδευσης."
            ]
        },
        {
            "tag": "research_info",
            "patterns": [
                "Πείτε μου για την έρευνα",
                "Δραστηριότητες έρευνας στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για την έρευνα;",
                "Λεπτομέρειες για τμήματα έρευνας",
                "Δημοσιεύσεις και σεμινάρια"
            ],
            "responses": [
                "Η ενότητα Έρευνας παρέχει πληροφορίες για τομείς έρευνας, σεμινάρια, διακρίσεις, διδακτορικά, δημοσιεύσεις και διάφορες κατηγορίες προσωπικού που εμπλέκονται σε δραστηριότητες έρευνας.",
                "Εξερευνήστε την ενότητα Έρευνας για λεπτομέρειες σχετικά με τομείς έρευνας, σεμινάρια, διακρίσεις, διδακτορικά, δημοσιεύσεις και διάφορες κατηγορίες προσωπικού που εμπλέκονται σε δραστηριότητες έρευνας.",
                "Ανακαλύψτε εισαγωγές στην Έρευνα, συμπεριλαμβανομένων τομέων έρευνας, σεμιναρίων, διακρίσεων, διδακτορικών, δημοσιεύσεων και διαφόρων κατηγοριών προσωπικού που εμπλέκονται σε δραστηριότητες έρευνας."
            ]
        },
        {
            "tag": "announcements_info",
            "patterns": [
                "Πείτε μου για τις ανακοινώσεις",
                "Ανακοινώσεις του πανεπιστημίου",
                "Ποιες ανακοινώσεις είναι διαθέσιμες;",
                "Λεπτομέρειες για επείγουσες ανακοινώσεις",
                "Γενικές ανακοινώσεις στο πανεπιστήμιο"
            ],
            "responses": [
                "Το τμήμα ανακοινώσεων καλύπτει πληροφορίες σχετικά με επείγουσες ανακοινώσεις, γενικές ανακοινώσεις, εγγραφές, δηλώσεις μαθημάτων, συγγράμματα, ανακοινώσεις για πρωτοετείς φοιτητές, προπτυχιακές σπουδές, μεταπτυχιακές σπουδές, διδακτορικές σπουδές, παρουσιάσεις διδακτορικών διατριβών, σεμινάρια, συνέδρια, υποτροφίες για μεταπτυχιακούς φοιτητές, ειδήσεις, εκδηλώσεις και ευκαιρίες απασχόλησης για πτυχιούχους.",
                "Εξερευνήστε την ενότητα Ανακοινώσεις για λεπτομέρειες σχετικά με επείγουσες ανακοινώσεις, γενικές ανακοινώσεις, εγγραφές, δηλώσεις μαθημάτων, συγγράμματα, ανακοινώσεις για πρωτοετείς φοιτητές, προπτυχιακές σπουδές, μεταπτυχιακές σπουδές, διδακτορικές σπουδές, παρουσιάσεις διδακτορικών διατριβών, σεμινάρια, συνέδρια, μεταπτυχιακές υποτροφίες, ειδήσεις, εκδηλώσεις και ευκαιρίες απασχόλησης για αποφοίτους.",
                "Ανακαλύψτε πληροφορίες για τις Ανακοινώσεις, όπως επείγουσες ανακοινώσεις, γενικές ανακοινώσεις, εγγραφές, δηλώσεις μαθημάτων, συγγράμματα, ανακοινώσεις για πρωτοετείς φοιτητές, προπτυχιακές σπουδές, μεταπτυχιακές σπουδές, διδακτορικές σπουδές, παρουσιάσεις διδακτορικών διατριβών, σεμινάρια, συνέδρια, μεταπτυχιακές υποτροφίες, ειδήσεις, εκδηλώσεις και ευκαιρίες απασχόλησης για αποφοίτους."
            ]
        },
        {
            "tag": "computer_labs_info",
            "patterns": [
                "Πες μου για τα εργαστήρια υπολογιστών",
                "Εργαστήρια υπολογιστών στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για εργαστήρια υπολογιστών;",
                "Λεπτομέρειες σχετικά με τους υπολογιστικούς πόρους",
                "Υπηρεσίες εργαστηρίων υπολογιστών"
            ],
            "responses": [
                "Το τμήμα 'Εργαστήρια υπολογιστών' παρέχει πληροφορίες σχετικά με το χώρο, το προσωπικό, τους υπολογιστικούς πόρους, τις υπηρεσίες, τις οδηγίες, το πρόγραμμα των αιθουσών, τους κανονισμούς λειτουργίας και τον τρόπο αποστολής αιτημάτων που σχετίζονται με τα εργαστήρια υπολογιστών.",
                "Εξερευνήστε το τμήμα Εργαστήρια υπολογιστών για πληροφορίες σχετικά με το χώρο, το προσωπικό, τους υπολογιστικούς πόρους, τις υπηρεσίες, τις κατευθύνσεις, το πρόγραμμα των αιθουσών, τους κανονισμούς λειτουργίας και τον τρόπο αποστολής αιτημάτων που σχετίζονται με τα εργαστήρια υπολογιστών.",
                "Ανακαλύψτε πληροφορίες σχετικά με τα εργαστήρια υπολογιστών, συμπεριλαμβανομένων των χώρων, του προσωπικού, των υπολογιστικών πόρων, των υπηρεσιών, των κατευθύνσεων, του προγράμματος αιθουσών, των κανονισμών λειτουργίας και του τρόπου αποστολής αιτημάτων που σχετίζονται με τα εργαστήρια υπολογιστών."
            ]
        }
    ]
}
