{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Χαίρετε",
                "Καλησπέρα",
                "Πώς πάει;",
                "Όλα καλα;",
                "Γεια",
                "Είναι κανείς εκει;",
                "Καλημέρα",
                "Καλησπέρα",
                "Γεια σου",
                "Γεια σας",
                "Καλησπέρα σας",
                "Γεια χαρά",
                "Καλησπέρα σας, τι μπορώ να κάνω για εσάς;"
            ],
            "responses": [
                "Χαίρετε",
                "Γεια σας, ευχαριστώ για την επίσκεψη. Τι μπορώ να κάνω για σας;",
                "Γεια σου, τι μπορώ να κάνω για σένα;",
                "Γεια σας, τι ψάχνετε;",
                "Γεια σας, μπορείτε να μου πείτε τι ψάχνετε;",
                "Καλημέρα!",
                "Καλησπέρα! Πώς είστε σήμερα;",
                "Γεια σας! Πώς μπορώ να σας βοηθήσω;"
            ]
        },
        { 
            "tag": "goodbye",
            "patterns": [
                "Αντίο",
                "Να έχετε μια καλή μέρα",
                "Γεια σας", 
                "Τα λέμε αργότερα",
                "Ευχαριστώ για τη βοήθεια",
                "Ευχαριστώ, αντίο",
                "Πάω τώρα",
                "Θα μιλήσουμε αργότερα",
                "Πάω να δω τις υπηρεσίες",
                "Τα λέμε!",
                "Καλή συνέχεια!",
                "Χαίρετε!",
                "Επιστρέφω σύντομα"
            ],
            "responses": [
                "Τα λέμε αργότερα, ευχαριστώ για την επίσκεψη",
                "Καλή σας μέρα",
                "Μπορώ να σας βοηθήσω με κάτι άλλο;",
                "Ευχαριστώ και αντίο",
                "Είμαι εδώ αν χρειαστείτε περισσότερη βοήθεια",
                "Ελπίζω να σας είχα βοηθήσει, αντίο",
                "Αντίο! Καλή συνέχεια!",
                "Πάντα στη διάθεσή σας! Αντίο!",
                "Ευχαριστούμε για την επίσκεψη! Αντίο!",
                "Είμαι εδώ αν χρειαστείτε οποιαδήποτε άλλη βοήθεια. Αντίο!",
                "Αντίο, καλή συνέχεια!"
            ]
        },
        {
            "tag": "professor_access",
            "patterns": [
                "Πώς μπορώ να έχω πρόσβαση στα κουμπιά σύνδεσης και εγγραφής;",
                "Ποιοι έχουν πρόσβαση στα κουμπιά σύνδεσης και εγγραφής",
                "Πώς μπορώ να συνδεθώ στη σελίδα;",
                "Γιατί δεν λειτουργούν οι κωδικοί μου για αυτό το σάιτ;",
                "Γιατί δεν μπορώ να συνδεθώ;",
                "Πρέπει να συνδεθώ στον λογαριασμό μου;",
                "Υπάρχει κάποιος τρόπος να συνδεθώ ως καθηγητής;"
            ],
            "responses": [
                "Συγγνώμη, η ιδιότητα login είναι διαθέσιμη μόνο για εξουσιοδοτημένους καθηγητές. Οι φοιτητές δεν έχουν πρόσβαση σε αυτήν τη λειτουργία.",
                "Συγγνώμη, αλλά τα κουμπιά σύνδεσης και εγγραφής είναι προνόμιο των καθηγητών μόνο."
            ]
        },
        {
            "tag": "progress_info",
            "patterns": [
                "Που μπορώ να βρω την πρόοδο μου;",
                "Πώς μπορώ να δω τις βαθμολογίες μου;",
                "Που είναι το Progress;",
                "Μπορείτε να μου πείτε πως να δω τις βαθμολογίες μου;",
                "Πως μπορώ να δω την πρόοδο μου στα μαθήματα;"
            ],
            "responses": [
                {
                  "text": "Το Progress είναι η πλατφόρμα όπου οι φοιτητές μπορούν να δουν τα σημειώματά τους και πολλά άλλα. Μπορείτε να επισκεφθείτε το Progress εδώ:",
                  "link": {
                    "text": "Επισκεφτείτε το Progress",
                    "url": "https://progress.upatras.gr/"
                  }
                }
              ]
        },
        
        {
            "tag": "university_services",
            "patterns": [
                "Ποιες υπηρεσίες προσφέρει ο δικτυακός τόπος του πανεπιστημίου;",
                "Πείτε μου για τις υπηρεσίες που προσφέρει ο δικτυακός τόπος του πανεπιστημίου",
                "Τι μπορώ να κάνω στον δικτυακό τόπο του πανεπιστημίου;",
                "Υπηρεσίες στον ιστότοπο του πανεπιστημίου",
                "Πώς μπορεί να με βοηθήσει ο δικτυακός τόπος του πανεπιστημίου;"
            ],
            "responses": [
                "Ο δικτυακός τόπος του πανεπιστημίου παρέχει ένα ευρύ φάσμα υπηρεσιών, που καλύπτουν διάφορους τομείς, όπως το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Υπολογιστών",
                "Μπορείτε να εξερευνήσετε διάφορες υπηρεσίες στην ιστοσελίδα του πανεπιστημίου, όπως πληροφορίες σχετικά με το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Υπολογιστών.",
                "Πλοηγηθείτε στον δικτυακό τόπο του πανεπιστημίου για να αποκτήσετε πρόσβαση σε συγκεκριμένες υπηρεσίες που αφορούν το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Υπολογιστών.",
                "Ανακαλύψτε πληθώρα πληροφοριών στην ιστοσελίδα του πανεπιστημίου, συμπεριλαμβανομένων λεπτομερειών σχετικά με το Τμήμα, την Εκπαίδευση, την Ποιότητα, την Έρευνα, το Προσωπικό, τις Ανακοινώσεις και τα Εργαστήρια Υπολογιστών."
            ]
        },
        {
            "tag": "department_info",
            "patterns": [
                "Πες μου για το τμήμα",
                "Πληροφορίες για το τμήμα",
                "Τι προσφέρει το Τμήμα;",
                "Λεπτομέρειες σχετικά με το Τμήμα",
                "Δομή του Τμήματος"
            ],
            "responses": [
                "Το τμήμα του Τμήματος καλύπτει πληροφορίες σχετικά με τους χαιρετισμούς, την ιστορία, τη δομή και τα όργανα, τη γραμματεία, τους εσωτερικούς κανονισμούς, τις επιτροπές του Τμήματος, την υγεία και την ασφάλεια, τις εκδηλώσεις του Τμήματος, τον κόμβο AI, τους αποφοίτους, τη διεθνή συμβουλευτική επιτροπή και τις καθημερινές ρυθμίσεις.",
                "Εξερευνήστε το τμήμα Τμήμα για πληροφορίες σχετικά με τους χαιρετισμούς, την ιστορία, τη δομή και τα όργανα, τη γραμματεία, τους εσωτερικούς κανονισμούς, τις επιτροπές του τμήματος, την υγεία και την ασφάλεια, τις εκδηλώσεις του τμήματος, το AI Hub, τους αποφοίτους, τη διεθνή συμβουλευτική επιτροπή και τις καθημερινές ρυθμίσεις.",
                "Ανακαλύψτε πληροφορίες σχετικά με το Τμήμα, όπως χαιρετισμούς, ιστορία, δομή και όργανα, γραμματεία, εσωτερικούς κανονισμούς, επιτροπές τμήματος, υγεία και ασφάλεια, εκδηλώσεις τμήματος, AI Hub, αποφοίτους, διεθνή συμβουλευτική επιτροπή και καθημερινές ρυθμίσεις."
            ]
        },
        {
            "tag": "education_info",
            "patterns": [
                "Πες μου για την εκπαίδευση",
                "Εκπαίδευση στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για την εκπαίδευση;",
                "Λεπτομέρειες σχετικά με τα ακαδημαϊκά προγράμματα",
                "Προπτυχιακή και μεταπτυχιακή εκπαίδευση"
            ],
            "responses": [
                "Το τμήμα 'Εκπαίδευση' παρέχει πληροφορίες σχετικά με τον οδηγό σπουδών, την προπτυχιακή εκπαίδευση, τη μεταπτυχιακή εκπαίδευση, το πρόγραμμα διδακτορικών σπουδών, το ακαδημαϊκό ημερολόγιο, το χρονοδιάγραμμα μαθημάτων-εξετάσεων, τον σύμβουλο καθηγητή και το ERASMUS+",
                "Εξερευνήστε το τμήμα Εκπαίδευση για πληροφορίες σχετικά με τον οδηγό σπουδών, την προπτυχιακή εκπαίδευση, τη μεταπτυχιακή εκπαίδευση, το πρόγραμμα διδακτορικών σπουδών, το ακαδημαϊκό ημερολόγιο, το χρονοδιάγραμμα μαθημάτων-εξετάσεων, τον σύμβουλο καθηγητή και το ERASMUS+.",
                "Ανακαλύψτε πληροφορίες για την Εκπαίδευση, όπως τον οδηγό σπουδών, την προπτυχιακή εκπαίδευση, τη μεταπτυχιακή εκπαίδευση, το πρόγραμμα διδακτορικών σπουδών, το ακαδημαϊκό ημερολόγιο, το χρονοδιάγραμμα μαθημάτων-εξετάσεων, τον σύμβουλο καθηγητή και το ERASMUS+."
            ]
        },
        {
            "tag": "quality_info",
            "patterns": [
                "Πες μου για την ποιότητα του Πανεπιστημίου",
                "Πολιτικές ποιότητας στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για τη διασφάλιση της ποιότητας;",
                "Λεπτομέρειες σχετικά με τις πολιτικές ποιότητας",
                "Διαπίστευση των προγραμμάτων"
            ],
            "responses": [
                "Το τμήμα 'Ποιότητα' καλύπτει πληροφορίες σχετικά με την πολιτική ποιότητας τη στοχοθεσία, τις εσωτερικές αξιολογήσεις των τμημάτων, τις εξωτερικές αξιολογήσεις των τμημάτων και τη διαπίστευση του προπτυχιακού προγράμματος σπουδών.",
                "Εξερευνήστε το τμήμα Ποιότητα για πληροφορίες σχετικά με την πολιτική ποιότητας, τη στοχοθεσία, τις εσωτερικές αξιολογήσεις τμημάτων, τις εξωτερικές αξιολογήσεις τμημάτων και τη διαπίστευση του προπτυχιακού προγράμματος σπουδών.",
                "Ανακαλύψτε πληροφορίες σχετικά με την Ποιότητα, όπως η πολιτική ποιότητας, η στόχευση, οι εσωτερικές αξιολογήσεις τμημάτων, οι εξωτερικές αξιολογήσεις τμημάτων και η διαπίστευση του προπτυχιακού προγράμματος σπουδών."
            ]
        },
        {
            "tag": "research_info",
            "patterns": [
                "Πες που για έρευνες που γίνονται",
                "Ερευνητικές δραστηριότητες στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για την έρευνα;",
                "Λεπτομέρειες σχετικά με τα ερευνητικά τμήματα",
                "Δημοσιεύσεις και εργαστήρια"
            ],
            "responses": [
                "Το τμήμα Έρευνα παρέχει πληροφορίες σχετικά με τους ερευνητικούς τομείς, τα εργαστήρια, τις διακρίσεις, τα διδακτορικά, τις δημοσιεύσεις και τις διάφορες κατηγορίες προσωπικού που συμμετέχουν σε ερευνητικές δραστηριότητες",
                "Εξερευνήστε το τμήμα Έρευνα για λεπτομέρειες σχετικά με τους ερευνητικούς τομείς, τα εργαστήρια, τις διακρίσεις, τα διδακτορικά, τις δημοσιεύσεις και τις διάφορες κατηγορίες προσωπικού που εμπλέκονται σε ερευνητικές δραστηριότητες.",
                "Ανακαλύψτε πληροφορίες για την έρευνα, συμπεριλαμβανομένων των ερευνητικών τομέων, των εργαστηρίων, των διακρίσεων, των διδακτορικών τίτλων, των δημοσιεύσεων και των διαφόρων κατηγοριών προσωπικού που εμπλέκονται σε ερευνητικές δραστηριότητες."
            ]
        },
        {
            "tag": "announcements_info",
            "patterns": [
                "Πείτε μου για τις ανακοινώσεις",
                "Ανακοινώσεις του Πανεπιστημίου",
                "Τι ανακοινώσεις είναι διαθέσιμες",
                "Λεπτομέρειες σχετικά με επείγουσες ανακοινώσεις",
                "Γενικές ανακοινώσεις στο πανεπιστήμιο"
            ],
            "responses": [
                "Το τμήμα 'Ανακοινώσεις' καλύπτει πληροφορίες σχετικά με επείγουσες ανακοινώσεις, γενικές ανακοινώσεις, εγγραφές, δηλώσεις μαθημάτων, συγγράμματα, ανακοινώσεις για πρωτοετείς φοιτητές, προπτυχιακές σπουδές, μεταπτυχιακές σπουδές, διδακτορικές σπουδές, παρουσιάσεις διδακτορικών διατριβών, σεμινάρια, συνέδρια, υποτροφίες για μεταπτυχιακούς φοιτητές, ειδήσεις, εκδηλώσεις και ευκαιρίες απασχόλησης για πτυχιούχους",
                "Εξερευνήστε την ενότητα Ανακοινώσεις για λεπτομέρειες σχετικά με επείγουσες ανακοινώσεις, γενικές ανακοινώσεις, εγγραφές, δηλώσεις μαθημάτων, συγγράμματα, ανακοινώσεις για πρωτοετείς φοιτητές, προπτυχιακές σπουδές, μεταπτυχιακές σπουδές, διδακτορικές σπουδές, παρουσιάσεις διδακτορικών διατριβών, σεμινάρια, συνέδρια, μεταπτυχιακές υποτροφίες, ειδήσεις, εκδηλώσεις και ευκαιρίες απασχόλησης για αποφοίτους.",
                "Ανακαλύψτε πληροφορίες για τις Ανακοινώσεις, όπως επείγουσες ανακοινώσεις, γενικές ανακοινώσεις, εγγραφές, δηλώσεις μαθημάτων, συγγράμματα, ανακοινώσεις για πρωτοετείς φοιτητές, προπτυχιακές σπουδές, μεταπτυχιακές σπουδές, διδακτορικές σπουδές, παρουσιάσεις διδακτορικών διατριβών, σεμινάρια, συνέδρια, μεταπτυχιακές υποτροφίες, ειδήσεις, εκδηλώσεις και ευκαιρίες απασχόλησης για αποφοίτους."
            ]
        },
        {
            "tag": "computer_labs_info",
            "patterns": [
                "Πείτε μου για το εργαστήριο",
                "Εργαστήρια υπολογιστών στο πανεπιστήμιο",
                "Τι προσφέρει το πανεπιστήμιο για εργαστήρια υπολογιστών;",
                "Λεπτομέρειες σχετικά με τους υπολογιστικούς πόρους",
                "Υπηρεσίες εργαστηρίων υπολογιστών"
            ],
            "responses": [
                "Το τμήμα 'Εργαστήρια υπολογιστών' παρέχει πληροφορίες σχετικά με το χώρο, το προσωπικό, τους υπολογιστικούς πόρους, τις υπηρεσίες, τις οδηγίες, το πρόγραμμα των αιθουσών, τους κανονισμούς λειτουργίας και τον τρόπο αποστολής αιτημάτων που σχετίζονται με τα εργαστήρια υπολογιστών.",
                "Εξερευνήστε το τμήμα Εργαστήρια υπολογιστών για πληροφορίες σχετικά με το χώρο, το προσωπικό, τους υπολογιστικούς πόρους, τις υπηρεσίες, τις κατευθύνσεις, το πρόγραμμα των αιθουσών, τους κανονισμούς λειτουργίας και τον τρόπο αποστολής αιτημάτων που σχετίζονται με τα εργαστήρια υπολογιστών.",
                "Ανακαλύψτε πληροφορίες σχετικά με τα εργαστήρια υπολογιστών, συμπεριλαμβανομένων των χώρων, του προσωπικού, των υπολογιστικών πόρων, των υπηρεσιών, των κατευθύνσεων, του προγράμματος αιθουσών, των κανονισμών λειτουργίας και του τρόπου αποστολής αιτημάτων που σχετίζονται με τα εργαστήρια υπολογιστών."
            ]
        }
    ]
}


